export const About = () => {
    return (
        <section
            className='container mt-10 grid gap-10 lg:grid-cols-2 [&_p]:font-book [&_p]:text-foreground/60'
            id='about'
        >
            <div className='rounded-2xl bg-background/40 px-4 py-8 transition-colors hover:bg-background/70 md:p-10'>
                <h2 className='text-2xl font-medium'>Про нас</h2>
                <p className='mt-3'>
                    Наша історія почалася у 2021 році з невеликого квіткового магазину
                    роздрібної торгівлі у Рівному. Тоді ми купували квіти гуртом з
                    Нідерландів за досить хорошою ціною. Звісно, хотілося кращої
                    пропозиції для закупівлі, але для цього потрібно було замовляти більші
                    обсяги товару. З такою кількістю квітів наша крамниця не могла
                    впоратися навіть теоретично. Так з’явилася ідея про потребу відкривати
                    гуртовий напрямок у нашому бізнесі.
                </p>
                <p className='mt-5'>
                    Ми відкрили гуртівню, взявши назву Flowers Opt. Загалом, все було не
                    так просто, як на словах, але команда впоралася. З новими обсягами
                    торгівлі прийшов новий досвід і глибше пізнання справи. Згодом стало
                    зрозуміло, що без невпинного розвитку, навчання та впровадження
                    інновацій в закупівлі квітів в наш час не обійтися. Відтоді ми
                    постійно щось тестуємо, пробуємо новинки для оптимізації
                    бізнес-процесів, намагаємося вдосконалити обслуговування. Хоча не всі
                    наші спроби успішні й не завжди все відповідає нашим очікуванням, ми
                    продовжуємо працювати над вдосконаленням задля якісного обслуговування
                    клієнтів.
                </p>
                <p className='mt-5'>
                    За роки існування на ринку нам вдалося в декілька разів збільшити наші
                    потужності, і ми продовжуємо розвиватися, розширюватися, впроваджувати
                    перспективні інновації та покращувати можливості сервісу закупівлі
                    квітів оптом для наших клієнтів.
                </p>
                <p className='mt-5'>
                    Нині ми співпрацюємо з понад трьома сотнями провідних виробників з
                    Європи, закуповуємо товар на найбільшому у світі квітковому аукціоні в
                    Нідерландах Royal Flora Holland. Завдяки цьому маємо можливість
                    запропонувати вам їхні якісні живі квіти гуртом за вигідною ціною.
                </p>
                <p className='mt-5'>
                    Проте наша діяльність не обмежується лише європейськими виробниками.
                    Нам пощастило домовитися про співпрацю з найкращими виробниками з
                    Еквадору, Колумбії та Кенії. У цьому випадку маємо справу з власниками
                    понад ста плантацій.
                </p>
                <p className='mt-5'>
                    Не менш вдалою є наша співпраця з українськими фермерськими
                    господарствами. Ми раді, що галузь вирощування квітів у нашій країні
                    активно розвивається.
                </p>
                <p className='mt-5'>
                    Основним напрямком нашої діяльності нині є гуртовий продаж зрізаних
                    квітів. Крім цього, у нас можна замовити різноманітні кімнатні рослини
                    та різні види флористичної фурнітури.
                </p>
                <p className='mt-5'>
                    Ми продовжуємо розвиватися: покращуємо логістичні можливості, працюємо
                    над відкриттям нових складів, автоматизуємо бізнес-процеси та
                    розробляємо додаток для максимальної зручності клієнтів, збільшуємо
                    команду та інвестуємо в її розвиток.
                </p>
                <p className='mt-5'>
                    Правду кажучи, на початку ми не сподівалися, що Flowers Opt за
                    декілька років переросте в окрему компанію, яка продовжуватиме стрімко
                    розвиватися, тому не надто задумувалися над особливою назвою чи стилем
                    бренду. Але, зважаючи на її розвиток, ми побачили потребу зміни
                    найменування та проведення ребрендингу. Тепер називаємося Apex Flora.
                    Нам подобається багатозначність першого слова нової назви. Воно
                    вмістило і верхню частину квітки, короновану бутоном, і стрімкість
                    руху на крутому повороті, й верхівку гори як символ цілі. З цим ми
                    продовжуємо наш невпинний розвиток до наступних вершин і пропонуємо
                    вам рости разом з нами.
                </p>
            </div>
            <div className='rounded-2xl bg-background/40 p-10 transition-colors hover:bg-background/70'>
                <h2 className='text-2xl font-medium'>Про наш сервіс</h2>
                <p className='mt-3'>
                    За нашими спостереженнями, нині на ринку багато компаній, які
                    займаються торгівлею квітами гуртом. Проте компаній, які мають
                    зручний, відмінний сервіс для купівлі квітів, без перебільшення,
                    одиниці. Тому ми вирішили зосередитися на створенні якісного,
                    максимально зрозумілого та зручного сервісу, який би відповідав
                    вимогам і потребам наших клієнтів. Це основний напрямок та мета наших
                    інвестицій сьогодні. Задля цього ми вивчаємо і переймаємо досвід
                    найкращих представників сфери гуртової торгівлі квітами. Впроваджуємо
                    інновації в роботу, прислухаючись до відгуків наших клієнтів.
                </p>

                <p className='mt-5'>
                    Сервіс, який ми пропонуємо, можна стисло описати словами: зручно,
                    професійно, сучасно і, що дуже важливо, вигідно.
                </p>

                <h3 className='mt-5 font-medium'>Зручно</h3>

                <p className='mt-5'>
                    Купуючи квіти оптом у веб-шопі Apex Flora, ви отримуєте цілодобовий
                    доступ до найбільшого асортименту квітів від садівників з Нідерландів,
                    Еквадору, Колумбії, Кенії, Ефіопії та багатьох інших країн світу, а
                    також від локальних виробників квітів з України. Для вашої зручності
                    ми зібрали їхні чудові живі квіти в одному місці. Загалом це понад
                    1500 видів (позицій каталогу).
                </p>

                <p className='mt-5'>
                    У нашому каталозі ви можете легко знайти товар, який вас цікавить.
                    Пошук можливий як за назвою квітів, так і за країною-виробником.
                    Фільтри допомагають відсіяти зайві опції та конкретизувати й
                    персоналізувати вибір. Якщо ви не впевнені щодо деяких позицій і
                    потребуєте часу на роздуми, ви можете відкласти їх у список бажаних,
                    щоб не загубити.
                </p>

                <p className='mt-5'>
                    Сайтом легко користуватися, він має простий, зрозумілий інтерфейс. На
                    випадок необхідності допомоги у створенні замовлення є ілюстрований
                    путівник-підказка.
                </p>

                <h3 className='mt-5 font-medium'>Професійно</h3>

                <p className='mt-5'>
                    Ми знаємо, що бізнес – непроста справа і що часто виникає багато
                    запитань, які потребують професійної поради чи допомоги. Враховуючи
                    це, ми передбачили наявність фахової підтримки. Замовляючи квіти
                    гуртом у нашому веб-шопі, ви отримуєте помічника з закупівлі квітів –
                    персонального менеджера, який допоможе вам у вирішенні будь-яких
                    питань, пов'язаних з вибором квітів, оформленням замовлення, оплатою
                    та доставкою товару тощо. Це значно економить ваш час та зусилля,
                    робить багато процесів простішими та ефективнішими.
                </p>

                <p className='mt-5'>
                    Формуючи замовлення на нашому сайті, ви можете обирати між трьома
                    опціями: передзамовлення, наявний на складі товару чи квіти, які вже
                    перебувають в дорозі до нас. Це допомагає планувати асортимент та
                    період його надходження.
                </p>

                <p className='mt-5'>
                    Професіонали дбають не лише про багатий вибір, їм важлива наявність
                    доставки, збереження товару під час транспортування, чіткі терміни
                    виконання замовлення. Ми вже подбали про це. Щотижня доставляємо квіти
                    нашими власними рефрижераторами від складу до дверей вашого магазину.
                    Передбачені також інші можливості доставки живих квітів оптом на вибір
                    клієнта.
                </p>

                <h3 className='mt-5 font-medium'>Сучасно</h3>

                <p className='mt-5'>
                    Вести бізнес, використовуючи онлайн можливості, це вже не привілей, а
                    потреба. Ми пропонуємо вам сучасний підхід до справи з використанням
                    сайту, який доступний вам 24/7 незалежно від вашого місця перебування,
                    з персональним менеджером, зі зв'язком для консультацій та вирішення
                    питань через зручні для вас месенджери чи телефон. В процесі
                    впровадження – чат-бот та застосунок. Разом з тим ми продовжуємо
                    працювати над розширенням можливостей та зручностей для наших клієнтів
                    і будемо раді вашим відгукам, побажанням та пропозиціям.
                </p>

                <h3 className='mt-5 font-medium'>Вигідно</h3>

                <p className='mt-5'>
                    Ми робимо все для того, щоб співпраця з нами була вам вигідна. Apex
                    Flora працює без посередників, тому ми можемо сформувати найкращу ціну
                    на ринку на квіти гуртом. Крім того, реєструючись у нашому веб-шопі,
                    ви отримуєте знижку на перше замовлення – 10%, а на всі наступні
                    замовлення – до 6%.
                </p>

                <p className='mt-5'>
                    Ще одна вигода полягає в можливості безкоштовної доставки замовлень
                    нашими рефрижераторами до дверей ваших квіткових магазинів.
                </p>

                <p className='mt-5'>
                    Звісно, можна сумніватися у сказаному, але краще спробувати замовити
                    квіти оптом на нашому сайті та переконатися у всіх перевагах.
                </p>
            </div>
        </section>
    )
}
