import {
    Accordion,
    AccordionContent,
    AccordionItem,
    AccordionTrigger
} from '@/components/ui/accordion'

const faqs = [
    {
        title: 'В які міста та регіони України доставляєте замовлені квіти гуртом?',
        description: (
            <div className='space-y-3'>
                <p>
                    Власними рефрижераторами ми доставляємо замовлення до таких міст:
                    Львів, Франківськ, Тернопіль, Хмельницький, Вінниця, Житомир, Київ,
                    Луцьк і Рівне. Цей список постійно розширюється, тому запитуйте у
                    менеджера про можливість доставки до вашого міста.
                </p>
                <p>
                    В інші міста передаємо квіти автобусами (переважно це міста, в які є
                    рейси з Рівного). <br /> По всій Україні доставляємо замовлені квіти
                    “Новою поштою”. <br />
                    Для підбору найкращого способу доставки обговоріть можливості з
                    менеджером.{' '}
                </p>
            </div>
        ),
        value: 'item-1'
    },
    {
        title: 'Які додаткові матеріали та аксесуари для флористів ви маєте?',
        description: (
            <p>
                Окрім квітів, ви можете купити у нас різні види упаковок для букетів,
                різноманітні стрічки, флористичну піну (оазис, піофлор), флористичні
                дроти, спрей-фарби, порошкові фарби для фарбування квітів, флористичні
                інструменти (ножиці, секатори, ножі, шипознімачі) та багато інших
                матеріалів для флористів.
            </p>
        ),
        value: 'item-2'
    },
    {
        title: 'Які умови співпраці з вами?',
        description: (
            <div className='space-y-3'>
                <p>
                    Ми працюємо лише з клієнтами, які зацікавлені у закупівлі квітів
                    гуртом. Як правило, це:
                    <ul className='mt-1 list-inside list-disc pl-4'>
                        <li>магазини та гуртівні; </li>
                        <li>декоратори або фрілансери; </li>
                        <li>особи, які певним чином пов’язані з квітковим бізнесом. </li>
                    </ul>
                </p>
            </div>
        ),
        value: 'item-3'
    },
    {
        title: 'Від якої кількості можливо робити замовлення? ',
        description: (
            <p>
                Мінімальна кількість зрізаних квітів у замовленні – 200 штук або сума
                замовлення від 5 тисяч гривень. Квіти продаємо тільки пачками.
            </p>
        ),
        value: 'item-4'
    },
    {
        title: 'Чи можна у вас замовити квіти оптом від місцевих виробників? ',
        description: (
            <p>
                Так. Ми щотижня отримуємо сезонні квіти від локальних виробників. У
                переліку тюльпани, лілії, іриси, еустома, хризантема, троянди, півонії,
                матіола та інші зрізані квіти в залежності від пори року.
            </p>
        ),
        value: 'item-5'
    },
    {
        title: 'Коли ви отримуєте квіти з Нідерландів в Україні?',
        description: (
            <p>
                Квіти надходять до нас за чітким графіком. У вівторок всі закуплені квіти
                виїжджають з Нідерландів, а вже у четвер ми приймаємо їх на нашому складі
                у Рівному. Доставляємо вам замовлення у п’ятницю, суботу та неділю.
            </p>
        ),
        value: 'item-6'
    },
    {
        title: 'Чи можу я замовити квіти телефоном через персонального менеджера?',
        description: (
            <p>
                Так. Замовити квіти гуртом можна через листування з вашим персональним
                менеджером або у телефонній розмові, але при такому оформленні ви не
                отримаєте додаткової знижки. Ця знижка передбачена лише при замовленні на
                сайті. Враховуйте це при закупівлі квітів.
            </p>
        ),
        value: 'item-7'
    },
    {
        title: 'Які терміни подачі передзамовлення на зріз з Нідерландів?',
        description: (
            <p>
                Передзамовлення на зріз з Нідерландів ми приймаємо щотижня до 17:00 у
                неділю. Два наступні дні ми викуповуємо квіти на аукціоні, а вже у четвер
                отримуємо їх на нашому складі в Україні та готуємо до видачі або
                відправлення вам.
            </p>
        ),
        value: 'item-8'
    },
    {
        title: 'Як краще планувати передзамовлення на зріз з Еквадору?',
        description: (
            <p>
                Оформляючи передзамовлення на зріз з Еквадору, Колумбії та Кенії, слід
                врахувати, що ми приймаємо його за тиждень до отримання товару, кожної
                неділі до 17:00. Тобто, якщо ви подаєте своє замовлення у неділю 19.05, то
                отримаєте його 30.05.
            </p>
        ),
        value: 'item-9'
    }
]

export const FAQ = () => {
    return (
        <section className='container mt-10'>
            <div className='flex flex-col items-center justify-center'>
                <h2 className='text-center text-2xl font-medium md:text-4xl'>
                    Відповіді на запитання
                </h2>
                <p className='mt-1 max-w-2xl font-book text-muted'>
                    Ніхто не скаже про тебе краще, ніж задоволений клієнт. Нам довіряють і
                    для нас це найдорожче
                </p>
            </div>

            <div className='flex flex-col items-center gap-10 md:mt-5 lg:flex-row'>
                <img
                    className='rounded-2xl object-cover object-top max-lg:h-96 max-lg:w-full max-md:hidden'
                    src='/img/home/faq-bg.jpg'
                    alt='Flowers'
                />
                <Accordion
                    className='w-full flex-1 py-5'
                    type='single'
                    collapsible
                >
                    {faqs.map((faq, index) => (
                        <AccordionItem
                            className='border-muted/50'
                            value={faq.value}
                            key={faq.value}
                        >
                            <AccordionTrigger
                                className='space-x-3 text-left text-xl'
                                iconType='plus-minus'
                            >
                                <div className='flex items-start gap-x-5'>
                                    <div> {String(index + 1).padStart(2, '0')}</div>
                                    <div>{faq.title}</div>
                                </div>
                            </AccordionTrigger>
                            <AccordionContent className='ml-6 text-muted'>
                                {faq.description}
                            </AccordionContent>
                        </AccordionItem>
                    ))}
                </Accordion>
            </div>
        </section>
    )
}
